xinshuwei/lpc1768/lpc1768_ontest/lpc1768_ontestDlg.cpp

// lpc1768_ontestDlg.cpp : 实现文件
//

#include "stdafx.h"
#include "lpc1768_ontest.h"
#include "lpc1768_ontestDlg.h"
#include "afxdialogex.h"
#include <io.h>
#include <list>
using namespace std;


#include <DbgHelp.h>
#pragma comment (lib,"dbghelp.lib")
//#pragma comment(lib,"libcserialportd.lib")

#include "winsock.h"
#include <IPHlpApi.h>
#pragma comment(lib,"Iphlpapi.lib")

#pragma  comment(lib,"Pcomm.lib")


#define  WM_UPDATEDATA   1000+1  // 更新界面 
#define  MaxBLock    4096



static HANDLE hExit;










void Uart_thread(LPCTSTR param)
{
	DWORD dRes;
	Clpc1768_ontestDlg* pthis = (Clpc1768_ontestDlg *)param;
	byte * data =NULL;
	byte bt;
	int recv_cout = 0;
	CString str;
	chrono::microseconds timespan(1000000);
	while (pthis->Uart_Open_flag)
	{
		dRes = WaitForSingleObject(hExit, 10);
		switch (dRes) {
		case WAIT_OBJECT_0://检测到退出线程命令
			return;
		default:
			break;
		}

		recv_cout = sio_iqueue(pthis->Uart_port);
		//有数据读到
		if (recv_cout > 0)
		{

			data = new byte [recv_cout];
			sio_read(pthis->Uart_port, (char*)data, recv_cout);

			//sprintf_s(str.GetBuffer(100), 100, data);
			for (int i = 0; i < recv_cout; i++)
			{
				bt = data[i];
				if (pthis->m_RecvHex.GetCheck())
					str.Format("0x%02x ", bt);
				else
					str.Format("%c", bt);
				pthis->m_strEditRecv += str;

			}
			pthis->m_rxlen += recv_cout;
			//pthis->GetDlgItem(IDC_EDIT_Recv)->SetWindowText(pthis->m_strEditRecv);
			SendMessage(pthis->m_hWnd, WM_UPDATEDATA, FALSE, FALSE);
			delete[]data;
			//str.ReleaseBuffer();
			str.Empty();
			pthis->DispStatus();
		}
		//else
		//{
		//	this_thread::sleep_for(timespan);
		//}



	}



}




#ifdef _DEBUG
#define new DEBUG_NEW
#endif


//波特率
int BaudRateArray[] = {9600,19200, 38400, 57600, 115200,230400,460800,921600 };
int CANBaudRate[] = { 50000,100000,125000,250000,500000 };
//CSerialPort m_Serial_Port;

// 用于应用程序“关于”菜单项的 CAboutDlg 对话框

class CAboutDlg : public CDialogEx
{
public:
	CAboutDlg();

// 对话框数据
#ifdef AFX_DESIGN_TIME
	enum { IDD = IDD_ABOUTBOX };
#endif

	protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV 支持

// 实现
protected:
	DECLARE_MESSAGE_MAP()
};

CAboutDlg::CAboutDlg() : CDialogEx(IDD_ABOUTBOX)
{
}

void CAboutDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
}

BEGIN_MESSAGE_MAP(CAboutDlg, CDialogEx)
	ON_WM_CLOSE()
	ON_WM_LBUTTONDOWN()
	ON_WM_LBUTTONUP()

END_MESSAGE_MAP()


// Clpc1768_ontestDlg 对话框



Clpc1768_ontestDlg::Clpc1768_ontestDlg(CWnd* pParent /*=NULL*/)
	: CDialogEx(IDD_LPC1768_ONTEST_DIALOG, pParent)
	, uart_baud_select(0)
	, m_strEditRecv(_T(""))
	, m_strEditSend(_T("www.xinshuwei.top"))
	, m_Web_port(0)
{
	m_hIcon = AfxGetApp()->LoadIcon(IDR_MAINFRAME);
}

void Clpc1768_ontestDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_COMBO_Uart_baud, m_Uart_Baud);
	DDX_Control(pDX, IDC_COMBO_Uart_port, m_Uart_Number);
	DDX_Control(pDX, IDC_BUTTON_OpenClose, m_OpenClose);
	DDX_Control(pDX, IDC_STATIC_state, m_state);
	DDX_Control(pDX, IDC_COMBO_WEB_Addr, m_Web_Ip);
	DDX_CBIndex(pDX, IDC_COMBO_Uart_baud, uart_baud_select);
	DDX_Control(pDX, IDC_COMBO_CAN_Baud, m_CAN_Baud);
	DDX_Control(pDX, IDC_COMBO_CAN_PORT, m_CAN_Port);
	DDX_Text(pDX, IDC_EDIT_Recv, m_strEditRecv);
	DDX_Text(pDX, IDC_EDIT_Send, m_strEditSend);
	DDX_Control(pDX, IDC_CHECK_RecvHex, m_RecvHex);
	DDX_Control(pDX, IDC_BUTTON_Send, m_SendButton);
	DDX_Control(pDX, IDC_HexSend, m_HexSend);
	DDX_Control(pDX, IDC_CHECK_AutoSend, m_AutoSend);
	DDX_Control(pDX, IDC_BUTTON_ClearSend, m_ClearSendButton);
	DDX_Control(pDX, IDC_COMBO_WEB_Type, m_Web_Type);
	DDX_Text(pDX, IDC_EDIT_WEB_port, m_Web_port);
}

BEGIN_MESSAGE_MAP(Clpc1768_ontestDlg, CDialogEx)
	ON_WM_SYSCOMMAND()
	ON_WM_PAINT()
	ON_WM_QUERYDRAGICON()
	ON_BN_CLICKED(IDCANCEL, &Clpc1768_ontestDlg::OnBnClickedCancel)
	ON_BN_CLICKED(IDC_BUTTON_OpenClose, &Clpc1768_ontestDlg::OnBnClickedButtonOpenclose)
	ON_BN_CLICKED(IDC_RADIO_UART, &Clpc1768_ontestDlg::OnBnClickedRadioUart)
	ON_BN_CLICKED(IDC_RADIO_CAN, &Clpc1768_ontestDlg::OnBnClickedRadioCan)
	ON_BN_CLICKED(IDC_RADIO_WEB, &Clpc1768_ontestDlg::OnBnClickedRadioWeb)
	ON_BN_CLICKED(IDC_BUTTON_SeachPort, &Clpc1768_ontestDlg::OnBnClickedButtonSeachport)
	ON_BN_CLICKED(IDC_BUTTON_SeachIP, &Clpc1768_ontestDlg::OnBnClickedButtonSeachip)
	ON_CBN_SELCHANGE(IDC_COMBO_Uart_baud, &Clpc1768_ontestDlg::OnCbnSelchangeComboUartbaud)
	ON_CBN_SELCHANGE(IDC_COMBO_Uart_port, &Clpc1768_ontestDlg::OnCbnSelchangeComboUartport)
	ON_CBN_SELCHANGE(IDC_COMBO_CAN_Baud, &Clpc1768_ontestDlg::OnCbnSelchangeComboCanBaud)
	ON_CBN_SELCHANGE(IDC_COMBO_CAN_PORT, &Clpc1768_ontestDlg::OnCbnSelchangeComboCanPort)
	//ON_MESSAGE(WM_COMM_RXCHAR, OnComm)
	ON_WM_TIMER()
	ON_MESSAGE(WM_UPDATEDATA, &Clpc1768_ontestDlg::OnUpdatedata)
	ON_BN_CLICKED(IDC_CHECK_RecvHex, &Clpc1768_ontestDlg::OnBnClickedCheckRecvhex)
	ON_BN_CLICKED(IDC_BUTTON_ClearRecv, &Clpc1768_ontestDlg::OnBnClickedButtonClearrecv)
	ON_BN_CLICKED(IDC_BUTTON_Send, &Clpc1768_ontestDlg::OnBnClickedButtonSend)
	//ON_BN_CLICKED(IDC_BUTTON2, &Clpc1768_ontestDlg::OnBnClickedButton2)
	ON_BN_CLICKED(IDC_BUTTON_ClearSend, &Clpc1768_ontestDlg::OnBnClickedButtonClearsend)
	ON_BN_CLICKED(IDC_CHECK_AutoSend, &Clpc1768_ontestDlg::OnBnClickedCheckAutosend)
END_MESSAGE_MAP()






//是否是数据段必备模块
inline BOOL IsDataSectionNeeded(const WCHAR* pModuleName)
{
	if (pModuleName == 0)
	{
		return FALSE;
	}

	WCHAR szFileName[_MAX_FNAME] = L"";

	//_wsplitpath(pModuleName, NULL, NULL, szFileName, NULL);
	_wsplitpath_s(pModuleName, NULL, NULL, szFileName,NULL,NULL,NULL,NULL,NULL);

	if (_wcsicmp(szFileName, L"ntdll") == 0)
		return TRUE;

	return FALSE;
}




//Dump文件回调
inline BOOL CALLBACK MiniDumpCallback(PVOID pParam, const PMINIDUMP_CALLBACK_INPUT   pInput, PMINIDUMP_CALLBACK_OUTPUT        pOutput)
{
	if (pInput == 0 || pOutput == 0)
		return FALSE;

