xinshuwei/lpc1768/lpc1768_ontest/lpc1768_ontestDlg.cpp
	switch (pInput->CallbackType)
	{
	case ModuleCallback:
		if (pOutput->ModuleWriteFlags & ModuleWriteDataSeg)
			if (!IsDataSectionNeeded(pInput->Module.FullPath))
				pOutput->ModuleWriteFlags &= (~ModuleWriteDataSeg);
	case IncludeModuleCallback:
	case IncludeThreadCallback:
	case ThreadCallback:
	case ThreadExCallback:
		return TRUE;
	default:;
	}

	return FALSE;
}

//创建dump文件
inline void CreateMiniDump(PEXCEPTION_POINTERS pep, LPCTSTR strFileName)
{
	HANDLE hFile = CreateFile(strFileName, GENERIC_READ | GENERIC_WRITE,
		FILE_SHARE_WRITE, NULL, CREATE_ALWAYS, FILE_ATTRIBUTE_NORMAL, NULL);

	if ((hFile != NULL) && (hFile != INVALID_HANDLE_VALUE))
	{
		MINIDUMP_EXCEPTION_INFORMATION mdei;
		mdei.ThreadId = GetCurrentThreadId();
		mdei.ExceptionPointers = pep;
		mdei.ClientPointers = NULL;

		MINIDUMP_CALLBACK_INFORMATION mci;
		mci.CallbackRoutine = (MINIDUMP_CALLBACK_ROUTINE)MiniDumpCallback;
		mci.CallbackParam = 0;

		::MiniDumpWriteDump(::GetCurrentProcess(), ::GetCurrentProcessId(), hFile, MiniDumpNormal, (pep != 0) ? &mdei : 0, NULL, &mci);

		CloseHandle(hFile);
	}
}
// 当出现崩溃时，会创建core.dmp 崩溃文件
LONG __stdcall MyUnhandledExceptionFilter(PEXCEPTION_POINTERS pExceptionInfo)
{
	CreateMiniDump(pExceptionInfo, _T("core.dmp"));

	return EXCEPTION_EXECUTE_HANDLER;
}

// Clpc1768_ontestDlg 消息处理程序

BOOL Clpc1768_ontestDlg::OnInitDialog()
{
	CDialogEx::OnInitDialog();

	// 将“关于...”菜单项添加到系统菜单中。

	// IDM_ABOUTBOX 必须在系统命令范围内。
	ASSERT((IDM_ABOUTBOX & 0xFFF0) == IDM_ABOUTBOX);
	ASSERT(IDM_ABOUTBOX < 0xF000);

	CMenu* pSysMenu = GetSystemMenu(FALSE);
	if (pSysMenu != NULL)
	{
		BOOL bNameValid;
		CString strAboutMenu;
		bNameValid = strAboutMenu.LoadString(IDS_ABOUTBOX);
		ASSERT(bNameValid);
		if (!strAboutMenu.IsEmpty())
		{
			pSysMenu->AppendMenu(MF_SEPARATOR);
			pSysMenu->AppendMenu(MF_STRING, IDM_ABOUTBOX, strAboutMenu);
		}
	}

	// 设置此对话框的图标。  当应用程序主窗口不是对话框时，框架将自动
	//  执行此操作
	SetIcon(m_hIcon, TRUE);			// 设置大图标
	SetIcon(m_hIcon, FALSE);		// 设置小图标

	// TODO: 在此添加额外的初始化代码

	if (GetLastError() == ERROR_ALREADY_EXISTS)//程序已在运行
	{
		AfxMessageBox(_T("程序已在运行"));
		SendMessage(WM_CLOSE);//关闭窗口
		return FALSE;
	}

	//dump文件处理
	SetUnhandledExceptionFilter(MyUnhandledExceptionFilter);



	CString temp;
	//添加波特率到下拉列表
	for (int i = 0; i < sizeof(BaudRateArray) / sizeof(int); i++)
	{
		temp.Format(_T("%d"), BaudRateArray[i]);
		m_Uart_Baud.AddString((LPCTSTR)temp);
	}



	for (int i = 0; i < sizeof(CANBaudRate) / sizeof(int); i++)
	{
		temp.Format(_T("%d"), CANBaudRate[i]);
		m_CAN_Baud.AddString((LPCTSTR)temp);
	}

	GetUartPort(m_Uart_Number);
	OnCbnSelchangeComboUartport();


	if ((_access(".\\SysCfg.ini", 0) == -1))//如果不存在
	{
		WritePrivateProfileString(_T("cfg"), _T("LptType"), _T("0"), _T(".\\SysCfg.ini"));
		WritePrivateProfileString(_T("Uart"), _T("Baud"), _T("115200"), _T(".\\SysCfg.ini"));
		WritePrivateProfileString(_T("Can"), _T("Port"), _T("0"), _T(".\\SysCfg.ini"));
		WritePrivateProfileString(_T("Can"), _T("Baud"), _T("100000"), _T(".\\SysCfg.ini"));
		WritePrivateProfileString(_T("Web"), _T("Type"), _T("0"), _T(".\\SysCfg.ini"));
		WritePrivateProfileString(_T("Web"), _T("Port"), _T("1530"), _T(".\\SysCfg.ini"));



	}
	LptType = ::GetPrivateProfileInt(_T("cfg"), _T("LptType"), 1, _T(".\\SysCfg.ini"));
	Can_port = ::GetPrivateProfileInt(_T("Can"), _T("Port"), 1, _T(".\\SysCfg.ini"));
	temp.Format(_T("%d"), ::GetPrivateProfileInt(_T("Uart"), _T("Baud"), 1, _T(".\\SysCfg.ini")));
	m_Uart_Baud.SetCurSel(m_Uart_Baud.FindString(0, temp));
	OnCbnSelchangeComboUartbaud();

	m_Web_Type.SetCurSel(::GetPrivateProfileInt(_T("Web"), _T("Type"), 1, _T(".\\SysCfg.ini")));
	
	m_Web_port = ::GetPrivateProfileInt(_T("Web"), _T("Port"), 1, _T(".\\SysCfg.ini"));

	temp.Format(_T("%d"), ::GetPrivateProfileInt(_T("Can"), _T("Baud"), 1, _T(".\\SysCfg.ini")));
	m_CAN_Baud.SetCurSel(m_CAN_Baud.FindString(0, temp));
	m_CAN_Port.SetCurSel(Can_port);


	


	//::GetPrivateProfileString("cfg", "ud_angle", " DefaultName", ud_angle_string.GetBuffer(100), 100, ".\\SysCfg.ini");
	//::GetPrivateProfileString("cfg", "lr_angle", " DefaultName", lr_angle_string.GetBuffer(100), 100, ".\\SysCfg.ini");
	//ud_angle_string.ReleaseBuffer();
	//lr_angle_string.ReleaseBuffer();
	//xFOVdeg = atof(lr_angle_string);
	//yFOVdeg = atof(ud_angle_string);



	switch (LptType)
	{
	case 0:
		CheckDlgButton(IDC_RADIO_UART, 1);
		OnBnClickedRadioUart();
		break;
	case 1:
		CheckDlgButton(IDC_RADIO_CAN, 1);
		OnBnClickedRadioCan();
		break;
	case 2:
		CheckDlgButton(IDC_RADIO_WEB, 1);
		OnBnClickedRadioWeb();
		break;
	default:
		CheckDlgButton(IDC_RADIO_UART, 1);
		OnBnClickedRadioUart();
		break;
	}
	GetDlgItem(IDC_RADIO_CAN)->EnableWindow(FALSE);
	//获取多网卡IP地址
	GetWebIp();



	









	return TRUE;  // 除非将焦点设置到控件，否则返回 TRUE
}

void Clpc1768_ontestDlg::OnSysCommand(UINT nID, LPARAM lParam)
{
	if ((nID & 0xFFF0) == IDM_ABOUTBOX)
	{
		CAboutDlg dlgAbout;
		dlgAbout.DoModal();
	}
	else
	{
		CDialogEx::OnSysCommand(nID, lParam);
	}
}


// 如果向对话框添加最小化按钮，则需要下面的代码
//  来绘制该图标。  对于使用文档/视图模型的 MFC 应用程序，
//  这将由框架自动完成。

void Clpc1768_ontestDlg::OnPaint()
{
	if (IsIconic())
	{
		CPaintDC dc(this); // 用于绘制的设备上下文

		SendMessage(WM_ICONERASEBKGND, reinterpret_cast<WPARAM>(dc.GetSafeHdc()), 0);

		// 使图标在工作区矩形中居中
		int cxIcon = GetSystemMetrics(SM_CXICON);
		int cyIcon = GetSystemMetrics(SM_CYICON);
		CRect rect;
		GetClientRect(&rect);
		int x = (rect.Width() - cxIcon + 1) / 2;
		int y = (rect.Height() - cyIcon + 1) / 2;

		// 绘制图标
		dc.DrawIcon(x, y, m_hIcon);
	}
	else
	{
		CDialogEx::OnPaint();
	}
}


BOOL Clpc1768_ontestDlg::PreTranslateMessage(MSG* pMsg)
{
	// TODO: 在此添加专用代码和/或调用基类
	if ((pMsg->message == WM_KEYDOWN && pMsg->wParam == VK_ESCAPE) || (pMsg->message == WM_KEYDOWN && pMsg->wParam == VK_SPACE) || (pMsg->message == WM_KEYDOWN && pMsg->wParam == VK_RETURN))
	{
		return TRUE;
	}
	return CDialogEx::PreTranslateMessage(pMsg);
}





//当用户拖动最小化窗口时系统调用此函数取得光标
//显示。
HCURSOR Clpc1768_ontestDlg::OnQueryDragIcon()
{
	return static_cast<HCURSOR>(m_hIcon);
}






void Clpc1768_ontestDlg::OnBnClickedCancel()
{
	// TODO: 在此添加控件通知处理程序代码
	CDialogEx::OnCancel();
}


void Clpc1768_ontestDlg::GetUartPort(CComboBox &colComPort)
{
	
		HKEY hKey;

