xinshuwei/lpc1768/lpc1768_ontest/lpc1768_ontestDlg.cpp
		if (::RegOpenKeyEx(HKEY_LOCAL_MACHINE, _T("Hardware\\DeviceMap\\SerialComm"), NULL, KEY_READ, &hKey) == ERROR_SUCCESS) // 打开串口注册表
		{
			int i = 0;
			wchar_t portName[256], commName[256];
			DWORD dwLong, dwSize;

			while (1)
			{
				dwLong = dwSize = sizeof(portName) / 2;   

				if (RegEnumValueW(hKey, i, portName, &dwLong, NULL, NULL, (PUCHAR)commName, &dwSize) == ERROR_NO_MORE_ITEMS) // 枚举串口
				{
					break;
				}

				colComPort.AddString(CString(commName)); // commName就是串口名字
				i++;
		}

			if (colComPort.GetCount() == 0)
			{
				//::PostMessage(GetMainFrame()->m_hWnd, WM_UPDATE_SYS_INFO, NULL, (LPARAM)SYSINFO_NO_COM);
				m_state.SetWindowText(_T("未发现串口"));
			}
			else
			{
				CString strTemp;

				strTemp.Format("共找到%d个串口可用...", colComPort.GetCount());  //display serached port, zhb 18/01/13
				m_state.SetWindowText(strTemp);

			}

			RegCloseKey(hKey);
	}


		if (m_Uart_Number.GetCount()>0)
		{
			m_Uart_Number.SetCurSel(0);
		}
}




void Clpc1768_ontestDlg::GetWebIp()
{	

	m_Web_Ip.ResetContent();//清除
	static int ADAPTERNUM = 10;
	PIP_ADAPTER_INFO pIpAdapterInfo = new IP_ADAPTER_INFO[ADAPTERNUM];// 10个网卡空间 足够了 
	unsigned long stSize = sizeof(IP_ADAPTER_INFO) * ADAPTERNUM;
	// 获取所有网卡信息，参数二为输入输出参数 
	int nRel = GetAdaptersInfo(pIpAdapterInfo, &stSize);
	// 空间不足
	if (ERROR_BUFFER_OVERFLOW == nRel) {
		// 释放空间
		if (pIpAdapterInfo != NULL)
			delete[] pIpAdapterInfo;
		return;
	}
	PIP_ADAPTER_INFO cur = pIpAdapterInfo;
	// 多个网卡 通过链表形式链接起来的 
	while (cur) {
		//cout << "网卡描述：" << cur->Description << endl;
		switch (cur->Type) {
		case MIB_IF_TYPE_OTHER:
			break;
		case MIB_IF_TYPE_ETHERNET:
		{
			IP_ADDR_STRING *pIpAddrString = &(cur->IpAddressList);
			//cout << "IP:" << pIpAddrString->IpAddress.String << endl;
			//cout << "子网掩码:" << pIpAddrString->IpMask.String << endl;
			m_Web_Ip.AddString(pIpAddrString->IpAddress.String);

		}
		break;
		case MIB_IF_TYPE_TOKENRING:
			break;
		case MIB_IF_TYPE_FDDI:
			break;
		case MIB_IF_TYPE_PPP:
			break;
		case MIB_IF_TYPE_LOOPBACK:
			break;
		case MIB_IF_TYPE_SLIP:
			break;
		default://无线网卡,Unknown type
		{
			IP_ADDR_STRING *pIpAddrString = &(cur->IpAddressList);
			//cout << "IP:" << pIpAddrString->IpAddress.String << endl;
			//cout << "子网掩码:" << pIpAddrString->IpMask.String << endl;
			m_Web_Ip.AddString(pIpAddrString->IpAddress.String);
		}
		break;
		}
		//char hex[16] = { '0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F' };

		//// mac 地址一般6个字节 
		//// mac 二进制转16进制字符串
		//char macStr[18] = { 0 };//12+5+1
		//int k = 0;
		//for (int j = 0; j < cur->AddressLength; j++) {
		//	macStr[k++] = hex[(cur->Address[j] & 0xf0) >> 4];
		//	macStr[k++] = hex[cur->Address[j] & 0x0f];
		//	macStr[k++] = '-';
		//}
		//macStr[k - 1] = 0;

		//cout << "MAC:" << macStr << endl; // mac地址 16进制字符串表示 
		cur = cur->Next;
		//cout << "--------------------------------------------------" << endl;
	}

	// 释放空间
	if (pIpAdapterInfo != NULL)
		delete[] pIpAdapterInfo;
}





void Clpc1768_ontestDlg::OnBnClickedButtonOpenclose()
{
	GetDlgItem(IDC_BUTTON_OpenClose)->EnableWindow(FALSE);
	CString temp;
	m_OpenClose.GetWindowText(temp);///获取按钮的文本
	UpdateData(true);
	if (temp =="关闭")///表示点击后是"关闭"，也就是此时串口或网络是打开的
		{
			switch (LptType)
			{
				case 0://串口
					//m_Serial_Port.ClosePort();//关闭
					sio_close(Uart_port);
					Uart_Open_flag = false;
					SetEvent(hExit);
					m_Uart_Baud.EnableWindow(TRUE);
					m_Uart_Number.EnableWindow(TRUE);
					GetDlgItem(IDC_BUTTON_SeachPort)->EnableWindow(TRUE);
					m_state.SetWindowText("串口已关闭");
					break;
				case 2://web
					m_state.SetWindowTextA("WEB已关闭");
					break;
				default:
					break;
			}
			m_OpenClose.SetWindowText("开启");///设置按钮文字为"打开串口"
		}
	else//串口或网络未打开 界面显示是开启
	{


		switch (LptType)
		{
		case 0://串口
			Open_Uart();
			
			break;
		case 2://web
			m_state.SetWindowTextA("WEB已开启");
			break;
		default:
			break;
		}

	}



	GetDlgItem(IDC_BUTTON_OpenClose)->EnableWindow(TRUE);
}


void __stdcall Uart_Cntlrq(int port)
{

	//sio_read(port, ibuf, 20); // 接 收 数 据 
	WPARAM ch = sio_getch(port);
	BSTR b = (BSTR)ch;
	CString s(b);
	SysFreeString(b);
	//m_strEditRecv += s;
	//UpdateData(FALSE);//将接收到的字符显示到编辑框上
}


void Clpc1768_ontestDlg::Open_Uart(void)
{
	CString static_text;
	int select_baud = m_Uart_Baud.GetCurSel();


	if (m_Uart_Number.GetCount() > 0)///当前列表的内容个数
	{

		int stats = sio_open(Uart_port);

		if (stats==SIO_OK)
		{
			sio_ioctl(Uart_port, select_baud +12, P_NONE | BIT_8 | STOP_1);

			//void __stdcall(* p)(int);
			//p = Uart_Cntlrq;
			//sio_cnt_irq(Uart_port, Uart_Cntlrq, 1);

			Uart_Open_flag = TRUE;
			m_OpenClose.SetWindowText("关闭");///设置按钮文字为"关闭"
			m_Uart_Baud.EnableWindow(FALSE);
			m_Uart_Number.EnableWindow(FALSE);
			GetDlgItem(IDC_BUTTON_SeachPort)->EnableWindow(FALSE);
			static_text.Format("串口 已打开COM%d 波特率%d  8  N 1", Uart_port, BaudRateArray[select_baud]);
			m_state.SetWindowText(static_text);
			hExit = CreateEvent(NULL, TRUE, FALSE, NULL);
			CreateThread(NULL, 0,(LPTHREAD_START_ROUTINE) Uart_thread, this, 0, NULL);
		}
		else
		{
			AfxMessageBox("未发现此串口或被占用");
			Uart_Open_flag = false;
			m_OpenClose.SetWindowText("开启");///设置按钮文字为"开启"
		}


	}
	else
	{
		AfxMessageBox("未发现串口");
		Uart_Open_flag = false;
		m_OpenClose.SetWindowText("开启");///设置按钮文字为"开启"

	}

}





void Clpc1768_ontestDlg::OnBnClickedRadioUart()
{
	// TODO: 在此添加控件通知处理程序代码
	//CheckDlgButton(IDC_RADIO_CAN, 0);
	CheckDlgButton(IDC_RADIO_WEB, 0);
	LptType = 0;
	GetDlgItem(IDC_COMBO_Uart_baud)->EnableWindow(TRUE);
	GetDlgItem(IDC_COMBO_Uart_port)->EnableWindow(TRUE);
	GetDlgItem(IDC_BUTTON_SeachPort)->EnableWindow(TRUE);

	GetDlgItem(IDC_COMBO_WEB_Type)->EnableWindow(FALSE);
	GetDlgItem(IDC_COMBO_WEB_Addr)->EnableWindow(FALSE);
	GetDlgItem(IDC_EDIT_WEB_port)->EnableWindow(FALSE);
	GetDlgItem(IDC_BUTTON_SeachIP)->EnableWindow(FALSE);


