xinshuwei/lpc1768/lpc1768_ontest/lpc1768_ontestDlg.cpp
	//GetDlgItem(IDC_COMBO_CAN_Baud)->EnableWindow(FALSE);
	//GetDlgItem(IDC_COMBO_CAN_PORT)->EnableWindow(FALSE);
	m_state.SetWindowText("开启串口配置");
}

void Clpc1768_ontestDlg::OnBnClickedRadioCan()
{
	// TODO: 在此添加控件通知处理程序代码
	CheckDlgButton(IDC_RADIO_UART, 0);
	CheckDlgButton(IDC_RADIO_WEB, 0);
	LptType = 1;
	GetDlgItem(IDC_COMBO_Uart_baud)->EnableWindow(FALSE);
	GetDlgItem(IDC_COMBO_Uart_port)->EnableWindow(FALSE);
	GetDlgItem(IDC_BUTTON_SeachPort)->EnableWindow(FALSE);

	GetDlgItem(IDC_COMBO_WEB_Type)->EnableWindow(FALSE);
	GetDlgItem(IDC_COMBO_WEB_Addr)->EnableWindow(FALSE);
	GetDlgItem(IDC_EDIT_WEB_port)->EnableWindow(FALSE);
	GetDlgItem(IDC_BUTTON_SeachIP)->EnableWindow(FALSE);


	GetDlgItem(IDC_COMBO_CAN_Baud)->EnableWindow(TRUE);
	GetDlgItem(IDC_COMBO_CAN_PORT)->EnableWindow(TRUE);
	m_state.SetWindowText("开启CAN配置");

}

void Clpc1768_ontestDlg::OnBnClickedRadioWeb()
{
	// TODO: 在此添加控件通知处理程序代码
	CheckDlgButton(IDC_RADIO_UART, 0);
	//CheckDlgButton(IDC_RADIO_CAN, 0);

	LptType = 2;
	GetDlgItem(IDC_COMBO_Uart_baud)->EnableWindow(FALSE);
	GetDlgItem(IDC_COMBO_Uart_port)->EnableWindow(FALSE);
	GetDlgItem(IDC_BUTTON_SeachPort)->EnableWindow(FALSE);

	GetDlgItem(IDC_COMBO_WEB_Type)->EnableWindow(TRUE);
	GetDlgItem(IDC_COMBO_WEB_Addr)->EnableWindow(TRUE);
	GetDlgItem(IDC_EDIT_WEB_port)->EnableWindow(TRUE);
	GetDlgItem(IDC_BUTTON_SeachIP)->EnableWindow(TRUE);


	//GetDlgItem(IDC_COMBO_CAN_Baud)->EnableWindow(FALSE);
	//GetDlgItem(IDC_COMBO_CAN_PORT)->EnableWindow(FALSE);
	m_state.SetWindowText("开启网络配置");

}

void Clpc1768_ontestDlg::OnBnClickedButtonSeachport()
{
	m_Uart_Number.ResetContent();
	// TODO: 在此添加控件通知处理程序代码
	GetUartPort(m_Uart_Number);

}

void Clpc1768_ontestDlg::OnBnClickedButtonSeachip()
{
	// TODO: 在此添加控件通知处理程序代码
	GetWebIp();
}

void Clpc1768_ontestDlg::OnCbnSelchangeComboUartbaud()
{
	// TODO: 在此添加控件通知处理程序代码
	UpdateData(TRUE);
	CString text, sendtext;
	int nSel = m_Uart_Baud.GetCurSel();
	m_Uart_Baud.GetLBText(nSel, text);
	Uart_baud = _ttoi(text);
	//sendtext
	//sprintf_s(sendtext,)
	sendtext.Format("当前串口波特率%d", Uart_baud);
	SetDlgItemText(IDC_STATIC_state, sendtext);
	
}

void Clpc1768_ontestDlg::OnCbnSelchangeComboUartport()
{
	// TODO: 在此添加控件通知处理程序代码
	UpdateData(TRUE);
	CString text, sendtext;
	int nSel = m_Uart_Number.GetCurSel();
	m_Uart_Number.GetLBText(nSel, text);
	Uart_port = String2int(text);
	sendtext.Format("当前串口号 %d", Uart_port);
	SetDlgItemText(IDC_STATIC_state, sendtext);
	
}


void Clpc1768_ontestDlg::OnCbnSelchangeComboCanBaud()
{
	// TODO: 在此添加控件通知处理程序代码
	UpdateData(TRUE);
	CString text, sendtext;
	int nSel = m_CAN_Baud.GetCurSel();
	m_CAN_Baud.GetLBText(nSel, text);
	Can_baud = _ttoi(text);
	sendtext.Format("当前CAN波特率%d", Can_baud);
	SetDlgItemText(IDC_STATIC_state, sendtext);
}


void Clpc1768_ontestDlg::OnCbnSelchangeComboCanPort()
{
	// TODO: 在此添加控件通知处理程序代码
	UpdateData(TRUE);
	Can_port = m_CAN_Port.GetCurSel();
	CString sendtext;
	sendtext.Format("当前CAN端口%d", Can_port+1);
	SetDlgItemText(IDC_STATIC_state, sendtext);
}



int Clpc1768_ontestDlg::String2int(CString str)
{
	int length;
	int i;
	TCHAR temp2[15];
	TCHAR temp[4];  // !!!! 尺寸小于temp2, 作其他用途必须改写 !!!!
	int count;

	lstrcpy(temp2, str);    //copies a string to a buffer

	count = 0;
	length = strlen(temp2);    //length保存了字符数组temp2的长度

	for (i = 0; i < length; i++)
	{
		if ((temp2[i] <= '9') && (temp2[i] >= '0'))
		{
			temp[count] = temp2[i];
			count++;
		}
	}

	temp[count] = 0;          //add string tail.\0'  zhb.2 18/01/23

	return (::atoi(temp));
}





//LONG Clpc1768_ontestDlg::OnComm(WPARAM ch, LPARAM port)
//{
//	BSTR b = (BSTR)ch;
//	CString s(b);
//	SysFreeString(b);
//	m_strEditRecv += s;
//	UpdateData(FALSE);//将接收到的字符显示到编辑框上
//
//	return 0;
//
//
//}






//更新UI界面
afx_msg LRESULT Clpc1768_ontestDlg::OnUpdatedata(WPARAM wParam, LPARAM lParam)
{
	UpdateData(lParam);
	return 0;
}


void Clpc1768_ontestDlg::OnBnClickedCheckRecvhex()
{
	// TODO: 在此添加控件通知处理程序代码
}


void Clpc1768_ontestDlg::OnBnClickedButtonClearrecv()
{
	// TODO: 在此添加控件通知处理程序代码
	m_strEditRecv.Empty();
	UpdateData(FALSE);
}



void Clpc1768_ontestDlg::OnBnClickedButtonSend()
{
	// TODO: 在此添加控件通知处理程序代码
	char abOut[MaxBLock];
	char  sendOut[MaxBLock];
	int OutNum, length;
	if (LptType == 0)
	{
		if (!Uart_Open_flag)
		{
			AfxMessageBox("串口未打开");
			return;
		}
		m_SendButton.EnableWindow(FALSE);
		m_ClearSendButton.EnableWindow(FALSE);

		CString str;
		GetDlgItem(IDC_EDIT_Send)->GetWindowText(str);
		int len = str.GetLength();
		for (int i=0;i<len;i++)
		{
			abOut[i] = str.GetAt(i);
		}
		if (m_HexSend.GetCheck())
		{
			CString strHexdata;
			abOut[len] = NULL;
			strHexdata = CString(abOut);
			len = String2Hex(strHexdata, sendOut);
			length = sio_write(Uart_port, sendOut, len);
		}
		else
		{
			length = sio_write(Uart_port,abOut, len);
		}
		m_txlen += length;
		DispStatus();
		m_SendButton.EnableWindow(TRUE);
		m_ClearSendButton.EnableWindow(TRUE);

		return;

		
		

	}
	if (LptType ==2)
	{




		return;



	}



	return;
}




int Clpc1768_ontestDlg::String2Hex(CString str, char *SendOut)
{
	int hexdata, lowhexdata;
	int hexdatalen = 0;
	int len = str.GetLength();
	//SendOut.SetSize(len/2);
	for (int i = 0; i < len;)
	{
		char lstr, hstr = str[i];
		if (hstr == ' ' || hstr == '\r' || hstr == '\n')
		{
			i++;
			continue;
		}
		i++;
		if (i >= len)
			break;
		lstr = str[i];
		hexdata = ConvertHexData(hstr);
		lowhexdata = ConvertHexData(lstr);
		if ((hexdata == 16) || (lowhexdata == 16))
			break;
		else
			hexdata = hexdata * 16 + lowhexdata;
		i++;
		SendOut[hexdatalen] = (char)hexdata;
		hexdatalen++;
	}
	//senddata.SetSize(hexdatalen);
	return hexdatalen;
}

char Clpc1768_ontestDlg::ConvertHexData(char ch)
{
	if ((ch >= '0') && (ch <= '9'))
		return ch - 0x30;
	if ((ch >= 'A') && (ch <= 'F'))
		return ch - 'A' + 10;
	if ((ch >= 'a') && (ch <= 'f'))
		return ch - 'a' + 10;
	else return(-1);
}



void Clpc1768_ontestDlg::DispStatus(void)
{
	CWnd *static_txlen = GetDlgItem(IDC_STATIC_TxCount);
	CWnd *static_rxlen = GetDlgItem(IDC_STATIC_RxCount);
	CString txlen_str, rxlen_str;
	txlen_str.Format("Tx:%ld", m_txlen);
	static_txlen->SetWindowText(txlen_str);
	rxlen_str.Format("Rx:%ld", m_rxlen);
	static_rxlen->SetWindowText(rxlen_str);

}


void Clpc1768_ontestDlg::OnBnClickedButtonClearsend()
{
	// TODO: 在此添加控件通知处理程序代码
	m_strEditSend.Empty();
	UpdateData(FALSE);
}


void Clpc1768_ontestDlg::OnBnClickedCheckAutosend()
{
	// TODO: 在此添加控件通知处理程序代码
	bAutoSend = !bAutoSend;
	if (bAutoSend)
	{
		SetTimer(1, 1000, NULL);
	} 
	else
	{
		KillTimer(1);
	}
}

void Clpc1768_ontestDlg::OnTimer(UINT_PTR nIDEvent)
{
	// TODO: 在此添加消息处理程序代码和/或调用默认值
	if (nIDEvent==1)
	{
		OnBnClickedButtonSend();
	}
	CDialogEx::OnTimer(nIDEvent);
}
